{
  "CONTACT": "Kontakt",
  "WORK": " Meine Projekte",
  "SKILLS": "Kompetenzen",
  "WHYME": "Warum ich", 
  "NAME": "Siarhei",
  "SURENAME": "Wehrhahn",
  "JOB": "Frontend Developer",
  "WHYMETEXT": "Ich bin immer begeistert, wenn ich die Möglichkeit habe, in eine neue Programmiersprache oder ein neues Framework einzutauchen. Meine Karriere zeigt deutlich meine Begeisterung für Lernen und Entwicklung: Ich begann mit der mobilen Entwicklung und entdeckte meine Leidenschaft für Programmierung. Direkt nach meiner IHK-Zertifizierung konzentrierte ich mich darauf, die nächste Programmiersprache zu lernen, um meinen Horizont zu erweitern. Besonders gerne beschäftige ich mich mit komplexen Themen und gehe sie auf eine lösungsorientierte und strukturierte Weise an. Meine Fähigkeit, mich schnell in neue Technologien einzuarbeiten, sowie mein Antrieb zur kontinuierlichen Verbesserung machen mich zu einem vielseitigen und zuverlässigen Mitarbeiter. Gleichzeitig arbeite ich gerne im Team, bringe Ideen ein und lasse mich von den Erfahrungen anderer inspirieren. Nun freue ich mich darauf, in das Berufsleben zurückzukehren, mein neu erlerntes Wissen anzuwenden und aktiv zum Erfolg Ihres Unternehmens beizutragen.",
  "IAM": "Ich bin",
  "LOCATED": "Ansässig in Lüdenscheid",
  "REMOTE": "Offen für Homeoffice",
  "RELOCATE": "Offen für einen Umzug",
  "CONTACTME": "Kontaktiere mich",
  "MYSKILLSET": "Mein Kompetenzbereich",
  "MYSKILLSTEXT": "Die IT-Welt verändert sich ständig, und ich freue mich immer, mein Wissen zu erweitern. Besonders interessieren mich neue Technologien und Tools, weil ich es liebe, an meinen Fähigkeiten zu arbeiten und immer etwas Neues zu lernen. Für mich ist es wichtig, nicht nur mit den Trends Schritt zu halten, sondern auch durch praktische Erfahrungen zu wachsen und neue Lösungen für die Herausforderungen zu finden, die mir begegnen.",
  "SKILLTEXT": "Ich freue mich immer, neue Technologien zu lernen, sag mir einfach, was du brauchst.",
  "ABOUT": "Über das Projekt",
  "JOINABOUTTEXT": "Join ist ein Gruppenprojekt, das vom Kanban-System inspiriert wurde. Es handelt sich um eine Organisations-App, mit der Nutzer To-dos erstellen, bestimmten Benutzern zuweisen und Aufgaben durch verschiedene Fortschrittsstufen bewegen können. Sobald eine Aufgabe abgeschlossen ist, kann sie als erledigt markiert werden. Die App bietet auch eine Kontaktliste und die Möglichkeit, Subtasks hinzuzufügen und abzuhaken.",
  "TECHNOLOGIES": "Technologien die ich verwendet habe",
  "LEARNED": "Was ich gelernt habe",
  "JOINLEARNEDTEXT": "Während dieses Projekts habe ich gelernt, dass erfolgreicher Teamwork stark auf effektiver Kommunikation beruht. Es ist entscheidend, dass das gesamte Team jedes Detail gemeinsam bespricht und sich auf einen klaren Handlungsplan einigt. Ich hatte das Glück, mit einem Team zu arbeiten, in dem die Zusammenarbeit hervorragend war. Jeder war engagiert, transparent und handelte auf Grundlage unserer gemeinsamen Vereinbarungen. Dieses Projekt hat mir die Bedeutung der Integration klarer Kommunikation und Teamarbeit in die Umsetzung eines komplexen Projekts nähergebracht.",
  "LOCOABOUTTEXT": "Pollo Loco ist ein aufregendes Jump-and-Run-Spiel, bei dem die Spieler Pepe dabei helfen, sich gegen kleine und große Hühner zu behaupten. Pepe kann seine gefiederten Gegner entweder durch Draufspringen oder durch das Werfen von Flaschen besiegen. Um Flaschen zu verwenden, muss Pepe sie jedoch zuerst sammeln, genauso wie er Münzen einsammelt, die im Spiel verstreut sind. Wenn es um das Endboss-Huhn geht, ist Pepes einzige Chance auf den Sieg, die gesammelten Flaschen zu nutzen. Das Spiel ist objektorientiert aufgebaut, was dynamische Interaktionen und ein spannendes Spielerlebnis garantiert.",
  "LOCOLEARNEDTEXT": "In diesem Projekt lag der Fokus auf objektorientierter Programmierung, um uns auf die Arbeit mit Angular vorzubereiten. Anfangs war es etwas ungewohnt, aber ich habe mich schnell eingearbeitet. Ich habe erkannt, wie viel effizienter dieser Ansatz ist, da Objekte nur einmal erstellt werden müssen und endlos wiederverwendet werden können. Dies vereinfacht nicht nur den Code, sondern macht ihn auch modularer und leichter wartbar.",
  "KIDDOABOUTTEXT": "Clever Kiddo ist eine Bildungs-App, die Kindern hilft, durch Spiel zu lernen. Sie deckt eine Vielzahl von Themen ab, darunter Zahlen, Farben und das Erkennen von Früchten und Gemüse. Die App bietet auch ein Cookie-Clicker-Spiel und ermöglicht es den Kindern, ihren eigenen Avatar auszuwählen. Für jede richtige Antwort erhalten die Spieler Sterne als Belohnung. In einem zukünftigen Update plane ich, eine Tamagotchi-Funktion einzuführen, bei der die verdienten Sterne verwendet werden können, um Nahrung, Getränke und Spielzeug für das virtuelle Haustier zu kaufen. Dieser unterhaltsame Ansatz macht das Lernen für Kinder spannend und interaktiv.",
  "KIDDOLERNEDTEXT": "Ich habe gelernt, wie man Firebase implementiert, um die Erstellung von Benutzerkonten zu ermöglichen, sei es über E-Mail und Passwort, anonym oder mit Google und Apple. Zudem habe ich Firebase für die Datenbankspeicherung integriert. Das Befolgen des MVVM-Musters war entscheidend, um die Code-Organisation und Klarheit zu wahren. Es sorgt dafür, dass verwandte Codeabschnitte ordentlich angeordnet sind, was Verwirrung verhindert und den Code leichter wartbar und erweiterbar macht. Außerdem hat die App internationale Beliebtheit erlangt und wurde in Ländern wie den USA, Taiwan, der Schweiz, Deutschland, Rumänien, Irland, Mexiko, Saudi-Arabien, Kanada und der Ukraine heruntergeladen, wobei einige der Downloads kostenpflichtig waren.",
  "JRADIOABOUTTEXT": "Ich habe JRadio für meinen Schwiegervater entwickelt, der minimale Anforderungen hatte. Er wollte eine App, die seinen 24/7-Radiosender abspielt, einen Link zu seinem Webradio bereitstellt und optional einen Livestream enthält. Ich konnte dies schnell umsetzen. Aufgrund der Richtlinien von Apple stellte sich die Veröffentlichung der App jedoch als schwierig heraus. Der Prüfprozess der App dauert 48 Stunden, und der Stream muss während dieser Zeit aktiv sein, um getestet zu werden. Daher haben wir uns entschieden, auf die Livestream-Funktion zu verzichten, um sicherzustellen, dass die App erfolgreich veröffentlicht werden kann.",
  "JRADIONLEARNEDTEXT": "In diesem Projekt habe ich gelernt, wie man eine einfache Radio-Streaming-App mit minimalen Anforderungen schnell implementiert. Ich sammelte Erfahrung in der Integration von Webradio- und Livestream-Funktionen und verstand die Herausforderungen, die durch Apples strenge Richtlinien für die App-Einreichung entstehen. Der Prozess lehrte mich die Bedeutung, plattformspezifische Anforderungen frühzeitig in der Entwicklung zu berücksichtigen, insbesondere bei Funktionen wie Livestreaming, die während der App-Prüfung getestet werden müssen. Außerdem lernte ich, wie man den Projektumfang anpasst, um sowohl technische als auch Einreichungsanforderungen effektiv zu erfüllen. Ein Highlight war der internationale Erfolg der App mit Downloads in Ländern wie den USA, Deutschland, den Niederlanden, Festland-China und der Ukraine.",
  "GROWBROABOUTTEXT": "GrowBro ist eine App, die mit der ChatGPT-API verbunden ist und speziell darauf trainiert wurde, alle Fragen zur Cannabiszucht zu beantworten. Mit der Entkriminalisierung von Cannabis am 1. April 2024 sah ich die Gelegenheit, einen KI-Assistenten zu entwickeln, der sich an Anfänger richtet. Die App ist einfach aufgebaut: Nutzer können sich entweder per E-Mail oder anonym registrieren und werden sofort zum Hauptbildschirm weitergeleitet, auf dem alle Interaktionen stattfinden. Hier können die Nutzer Fragen stellen, und bevor die KI antwortet, bewertet sie, ob die Antwort für die Pflanze hilfreich oder potenziell schädlich wäre. Basierend auf dieser Einschätzung bietet sie zwei mögliche Antworten an, zusammen mit den Vor- und Nachteilen jeder Option, sodass die Nutzer umfassende und detaillierte Anleitung erhalten, ohne häufig Folgefragen stellen zu müssen.",
  "GROWBROLEARNEDTEXT": "Ich habe gelernt, wie man mit der ChatGPT-API arbeitet und die Bedeutung verstanden, Software zu entwickeln, die auf aktuelle Ereignisse abgestimmt ist. Dieser Ansatz kann erhebliches Nutzerinteresse wecken, was zu vielen Downloads und sogar einigen Verkäufen führt. Zudem lehrte mich das Projekt, wie man durch die Kombination von relevantem Inhalt und benutzerfreundlicher Technologie einen Mehrwert schafft, was zu einem erfolgreichen App-Launch führte.",
  "MORE": "mehr",
  "LESS": "weniger",
  "ONGOING": "Laufendes Projekt",
  "ONGOINGTEXT": "Mein aktuelles Projekt konzentriert sich auf ein IT-Unternehmen, das eine neue Website für sein Geschäft benötigt. Dieses Projekt ist sowohl spannend als auch herausfordernd, da der Erfolg in sorgfältiger Planung und präziser Ausführung liegt. Wenn du eine spezielle Anfrage oder Idee hast, kannst du dich gerne über den Kontaktbereich an mich wenden. Ich werde mein Bestes tun, um deine Vision zum Leben zu erwecken!",
  "LETSTALK": "Lass uns reden",
  "REFERENCES": "Referenzen",
  "TEAMPLAYER": "Teamplayer gesucht?",
  "TEAMCOLLEAGUES": "Hier ist, was meine Kollegen über mich sagen.",
  "SEBASTIANTEXT": "Während des Gruppenprojekts 'Kochwelt' zu Beginn des Kurses hat Siarhei immer wieder gezeigt, wie hilfsbereit und zuvorkommend er ist. Durch seine fortgeschrittene Erfahrung konnte er den Mitgliedern unserer Gruppe immer wieder wertvolle Tipps geben und hat so maßgeblich zum Erfolg des Projekts beigetragen. Auch außerhalb von Gruppenprojekten stand er seinen Mitmenschen stets mit Rat und Tat zur Seite. Ein echter Teamplayer.",
  "SEBASTIANPROJECT": "Projekt Kochwelt",
  "JASONTEXT": "Ich hatte das Vergnügen, mit Siarhei am Gruppenprojekt JOIN zu arbeiten. Er war immer zuverlässig und zeigte beeindruckende schnelle Lernfähigkeiten sowie die Fähigkeit, neues Wissen effektiv anzuwenden und zu vertiefen. Dank seiner hervorragenden Kommunikationsfähigkeiten führte Siarhei die Gruppe selbstbewusst und sorgte für eine produktive Zusammenarbeit. Seine Hilfsbereitschaft und sein Engagement machten die Zusammenarbeit mit ihm zu einer wirklich angenehmen Erfahrung. Ich kann Siarhei für zukünftige Projekte wärmstens empfehlen.",
  "JASONPROJECT": "Projekt Join",
  "BENTEXT": "Obwohl ich nicht die Gelegenheit hatte, eng mit Siarhei zusammenzuarbeiten, hat er dennoch einen bleibenden Eindruck hinterlassen. Seine Hilfsbereitschaft und sein umfangreiches Wissen erwiesen sich als äußerst wertvoll bei der Lösung einiger meiner Herausforderungen. Er nahm sich stets die Zeit, meine Probleme zu verstehen, und bot durchdachte, lösungsorientierte Unterstützung. Eine Zusammenarbeit mit ihm wäre ohne Zweifel eine große Bereicherung!",
  "BENPROJECT": "Lernhilfe",
  "MARCTEXT": "Ich hatte die Gelegenheit, mit einem talentierten Programmierer zusammenzuarbeiten und habe dabei viel gelernt. Er ist effizient, schnell und präzise. Wann immer kleinere Herausforderungen auftauchen, ist Sergej immer da, um sie schnell zu lösen. Am meisten hat mich seine Arbeitsmoral und der strategische Ansatz, den er bei Projekten verfolgt, beeindruckt.",
  "MARCPROJECT": "Lernhilfe",
  "YOURNAME": "Dein Name",
  "YOUREMAIL": "Deine Email",
  "WRITESOMETHING": "Schreibe etwas",
  "ENTERMESSAGE": "Bitte geben Sie eine Nachricht ein",
  "FAILEDTEXT": "Bitte akzeptieren Sie die Datenschutzrichtlinie",
  "TERM1": "Ich habe die",
  "TERM2": "Datenschutzrichtlinie",
  "TERM3": "gelesen und stimme der Verarbeitung meiner Daten wie beschrieben zu.",
  "PRIVACYPOLICYACCEPTION": "Ich habe die Datenschutzerklärung gelesen und stimme der Verarbeitung meiner Daten wie darin beschrieben zu.",
  "SEND": "senden",
  "LETSWORK": "Lass uns gemeinsam an deinem nächsten Projekt arbeiten.",
  "LETSWORKTEXT": "Egal, ob du eine neue Webanwendung entwickeln, bestehende Systeme optimieren oder maßgeschneiderte Mobile Apps für iOS und Android erstellen möchtest – als zertifizierter Web Developer und IHK-zertifizierter Mobile Developer bringe ich das technische Know-how und die Problemlösungsfähigkeiten mit, die notwendig sind, um deine Vision in einen Erfolg zu verwandeln.",
  "LEGALNOTICE": "Impressum",
  "PRIVACYPOLICY": "Datenschutzerklärung",
  "IMPRINT": "Impressum",
  "PRIVACY_POLICY": "Datenschutzerklärung",
  "IMPRINT_DESCRIPTION": "Angaben gemäß § 5 DDG",
  "CONTACT_PERSON": "Vertreten durch:",
  "CONTACT_INFO": "Kontakt:",
  "PHONE": " Telefon:",
  "DISCLAIMER": "Haftungsausschluss",
  "DISCLAIMER_CONTENT": "Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen. Als Diensteanbieter sind wir gemäß § 7 Abs.1 DDG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich.",
  "PRIVACY_CONTENT": "Die Nutzung unserer Webseite ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf unseren Seiten personenbezogene Daten erhoben werden, erfolgt dies, soweit möglich, stets auf freiwilliger Basis. Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben."
}