{
  "CONTACT": "Contact",
  "WORK": "My Projects",
  "SKILLS": "Skills",
  "WHYME": "Why Me",
  "NAME": "Siarhei",
  "SURENAME": "Wehrhahn",
  "JOB": "Frontend Developer",
  "WHYMETEXT": "I’m always excited when I have the opportunity to dive into a new programming language or framework. My career clearly shows my enthusiasm for learning and development: I started with mobile development and discovered my passion for programming. Right after my IHK certification, I focused on learning the next programming language to expand my horizons. I especially enjoy working with complex topics and approaching them in a solution-oriented and structured way. My ability to quickly adapt to new technologies and my drive for continuous improvement make me a versatile and reliable team member. At the same time, I enjoy working in teams, contributing ideas, and being inspired by the experiences of others. Now, I’m excited to return to the professional world, apply my newly acquired knowledge, and actively contribute to the success of your company.",
  "IAM": "I am",
  "LOCATED": "Located in Lüdenscheid",
  "REMOTE": "Open to remote work",
  "RELOCATE": "Open to relocation",
  "CONTACTME": "Contact Me",
  "MYSKILLSET": "My Skillset",
  "MYSKILLSTEXT": "The IT world is constantly changing, and I’m always excited to expand my knowledge. I’m particularly interested in new technologies and tools because I love working on my skills and learning something new. For me, it’s important not just to keep up with the trends but also to grow through hands-on experience and find new solutions to the challenges I face.",
  "SKILLTEXT": "I’m always happy to learn new technologies, just tell me what you need.",
  "ABOUT": "About the Project",
  "JOINABOUTTEXT": "Join is a group project inspired by the Kanban system. It’s an organizational app where users can create to-dos, assign them to specific users, and move tasks through various progress stages. Once a task is completed, it can be marked as done. The app also offers a contact list and the ability to add and check off subtasks.",
  "TECHNOLOGIES": "Technologies I've Used",
  "LEARNED": "What I Learned",
  "JOINLEARNEDTEXT": "Lesson learned from the Join project: During this project, I learned that successful teamwork relies heavily on effective communication. It’s crucial that the entire team discusses every detail together and agrees on a clear action plan. I was lucky to work with a team where collaboration was excellent. Everyone was engaged, transparent, and acted based on our mutual agreements. This project taught me the importance of integrating clear communication and teamwork into the execution of a complex project.",
  "LOCOABOUTTEXT": "Pollo Loco is an exciting jump-and-run game where players help Pepe face off against small and large chickens. Pepe can defeat his feathery opponents either by jumping on them or by throwing bottles. To use bottles, Pepe first has to collect them, just like he collects coins scattered around the game. When it comes to the final boss chicken, Pepe’s only chance to win is to use the bottles he has collected. The game is object-oriented, ensuring dynamic interactions and an exciting gaming experience.",
  "LOCOLEARNEDTEXT": "In this project, the focus was on object-oriented programming to prepare us for working with Angular. At first, it was a bit unfamiliar, but I quickly got the hang of it. I realized how much more efficient this approach is, as objects only need to be created once and can be reused endlessly. This not only simplifies the code but also makes it more modular and easier to maintain.",
  "KIDDOABOUTTEXT": "Clever Kiddo is an educational app that helps children learn through play. It covers a variety of topics, including numbers, colors, and identifying fruits and vegetables. The app also features a cookie-clicker game and lets kids choose their own avatar. For every correct answer, players earn stars as rewards. In a future update, I plan to introduce a Tamagotchi feature where earned stars can be used to buy food, drinks, and toys for a virtual pet. This fun approach makes learning exciting and interactive for kids.",
  "KIDDOLERNEDTEXT": "I learned how to implement Firebase to allow account creation via email and password, anonymously, or with Google and Apple. I also integrated Firebase for database storage. Following the MVVM pattern was crucial for maintaining code organization and clarity. It ensures that related code sections are neatly arranged, preventing confusion and making the code easier to maintain and expand. Furthermore, the app gained international popularity and was downloaded in countries like the USA, Taiwan, Switzerland, Germany, Romania, Ireland, Mexico, Saudi Arabia, Canada, and Ukraine, with some of the downloads being paid.",
  "JRADIOABOUTTEXT": "I developed JRadio for my father-in-law, who had minimal requirements. He wanted an app that would play his 24/7 radio station, provide a link to his web radio, and optionally include a live stream. I was able to implement this quickly. However, due to Apple's guidelines, publishing the app proved challenging. The app review process takes place within 48 hours, and the stream needs to be active during that time for testing. As a result, we decided to forgo the live stream feature to ensure the app could be successfully published.",
  "JRADIONLEARNEDTEXT": "In this project, I learned how to quickly implement a simple radio streaming app with minimal requirements. I gained experience in integrating web radio and live streaming features while also understanding the challenges posed by Apple's strict guidelines for app submissions. The process taught me the importance of considering platform-specific requirements early in development, especially for features like live streaming that need to be tested during the app review. Additionally, I learned how to adjust the project scope to effectively meet both technical and submission requirements. One highlight was the app's international success, with downloads in countries such as the USA, Germany, the Netherlands, Mainland China, and Ukraine.",
  "GROWBROABOUTTEXT": "GrowBro is an app connected to the ChatGPT API, specifically trained to answer all questions about cannabis cultivation. With the decriminalization of cannabis on April 1, 2024, I saw an opportunity to create an AI assistant tailored for beginners. The app is straightforward: users can register either via email or anonymously and are immediately directed to the main screen, where all interactions take place. Here, users can ask questions, and before responding, the AI evaluates whether its answer would be helpful or potentially harmful to the plant. Based on this assessment, it provides two possible answers, along with the pros and cons of each option, ensuring users get comprehensive and detailed guidance without needing to ask follow-up questions frequently.",
  "GROWBROLEARNEDTEXT": "I learned how to work with the ChatGPT API and understood the importance of developing software that aligns with current events. This approach can drive significant user interest, resulting in many downloads and even some sales. Additionally, the project taught me how to create value by combining relevant content with user-friendly technology, leading to a successful app launch.",
  "MORE": "Show me more",
  "LESS": "Show me less",
  "ONGOING": "Ongoing Project",
  "ONGOINGTEXT": "My current project focuses on an IT company that requires a new website for its business. This project is both exciting and challenging, as success lies in meticulous planning and precise execution. If you have a specific request or idea in mind, feel free to reach out to me via the contact section. I’ll do my best to bring your vision to life!",
  "LETSTALK": "Let’s Talk",
  "REFERENCES": "References",
  "TEAMPLAYER": "Need a teamplayer?",
  "TEAMCOLLEAGUES": "Here what my colleagues said about me",
  "SEBASTIANTEXT": "During the group project 'Kochwelt' at the beginning of the course, Siarhei repeatedly showed how helpful and considerate he is. Due to his advanced experience, he was able to give valuable advice to the members of our group, significantly contributing to the success of the project. Even outside of group projects, he was always there to help others with advice and assistance. A true team player.",
  "SEBASTIANPROJECT": "Project Kochwelt",
  "JASONTEXT": "I had the pleasure of working with Siarhei on the group project JOIN. He was always reliable and demonstrated impressive quick learning skills, as well as the ability to effectively apply and deepen new knowledge. Thanks to his excellent communication skills, Siarhei confidently managed the group and ensured productive collaboration. His helpfulness and dedication made working with him a truly enjoyable experience. I highly recommend Siarhei for future projects.",
  "JASONPROJECT": "Project Join",
  "BENTEXT": "Although I didn’t have the chance to work closely with Siarhei, he still left a lasting impression. His willingness to help and his extensive knowledge proved invaluable in solving some of my challenges. He always took the time to understand my issues and provided thoughtful, solution-oriented support. Collaborating with him would undoubtedly be a great asset!",
  "BENPROJECT": "Learning Support",
  "MARCTEXT": "I had the chance to work with a talented programmer and learned a lot in the process. He is efficient, fast, and precise. Whenever minor challenges arise, Sergej is always there to solve them quickly. What impressed me the most was his work ethic and the strategic approach he takes to projects.",
  "MARCPROJECT": "Learning Support",
  "YOURNAME": "Your Name",
  "YOUREMAIL": "Your Email",
  "WRITESOMETHING": "Write Something",
  "ENTERMESSAGE": "Please enter a message",
  "FAILEDTEXT": "Please accept the privacy policy",
  "TERM1": "I've read the",
  "TERM2": "privacy policy",
  "TERM3": "and agree to he processing of my data as outlined",
  "PRIVACYPOLICYACCEPTION": "I have read the privacy policy and agree to the processing of my data as outlined.",
  "SEND": "Send",
  "LETSWORK": "Let’s work together on your next project.",
  "LETSWORKTEXT": "Whether you need to develop a new web application, optimize existing systems, or create tailored mobile apps for iOS and Android – as a certified Web Developer and IHK-certified Mobile Developer, I bring the technical expertise and problem-solving skills needed to turn your vision into success.",
  "LEGALNOTICE": "Legal Notice",
  "PRIVACYPOLICY": "Privacy Policy",
  "IMPRINT": "Imprint"
}